<!-- dflook/terraform-github-actions {"workspace":"variables-renderer","backend":"5149c6c1a838d5f0d96ba02ecd756fdf20bfda69f596d9c03b0826415db42609","backend_type":"remote","plan_modifier":"b0290c8150ae92d755bd7f79918a5400b47951132d040bb679259d282742cb6d","plan_job_ref":"Job Test plan target and replace #285 at https://github.com/dflook/terraform-github-actions/actions/runs/3526569819","plan_hash":"6c18e9ec6359580ed2d454d54e993f5dbfaaf7186c4747461410b10f973caaf3","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __variables-renderer__ workspace
Targeting resources: `random_string.count[0]`<details><summary>With variables</summary>

```hcl
length = 5

```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.count[0] will be created
  + resource "random_string" "count" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + count = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #285](https://github.com/dflook/terraform-github-actions/actions/runs/3526569819)